app/views/games/show.html.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          %h3= review.title
          %p.posted-by= "Posted by #{User.find(review.user_id).full_name}"