app/controllers/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "game_tags".* FROM "game_tags" WHERE "game_tags"."game_id" = 1
SELECT "reviews".* FROM "reviews" WHERE "reviews"."game_id" = 1
---
  def show
    @game = Game.find(params[:id])
    @tags = GameTag.where(game: @game)
    @reviews = Review.where(game: @game)

INSERT INTO "games" ("title", "players", "age", "play_time", "complexity", "publisher", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "game_tags" ("tag_id", "game_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_id", 1], ["game_id", 1], ["created_at", 2017-04-21 06:05:42 UTC], ["updated_at", 2017-04-21 06:05:42 UTC]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "hello"], ["created_at", 2017-04-21 06:05:42 UTC], ["updated_at", 2017-04-21 06:05:42 UTC]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "hello"], ["LIMIT", 1]]
---
  def create
    tag_params = game_params[:tags]
    tags = tag_params.split(',')
    new_game_params = game_params.except(:tags)
    @game = Game.new(new_game_params)
    @game.user_id = current_user.id

    respond_to do |format|
      if @game.save
        tags.each do |tag|
          Tag.create(name: tag)
          found_tag = Tag.find_by(name: tag)

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "votes" SET "value" = $1, "updated_at" = $2 WHERE "votes"."id" = $3  [["value", 2], ["updated_at", 2017-04-21 06:31:55 UTC], ["id", 1]]
INSERT INTO "votes" ("voteable_type", "voteable_id", "user_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["voteable_type", "Game"], ["voteable_id", 1], ["user_id", 1], ["value", 1], ["created_at", 2017-04-21 06:31:52 UTC], ["updated_at", 2017-04-21 06:31:52 UTC]]
---
  def upvote
    @game = Game.find(params[:game_id])
    @vote = Vote.find_by(voteable: @game, user_id: current_user.id)
    if @vote
      @vote.increase
      @vote.save
      redirect_to @game
    else
      @vote = Vote.new(voteable: @game, user_id: current_user.id, value: 1 )
      @vote.save

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "votes" SET "value" = $1, "updated_at" = $2 WHERE "votes"."id" = $3  [["value", 1], ["updated_at", 2017-04-21 06:31:57 UTC], ["id", 1]]
---
  def downvote
    @game = Game.find(params[:game_id])
    @vote = Vote.find_by(voteable: @game, user_id: current_user.id)
    if @vote
      @vote.decrease
      @vote.save