app/controllers/reviews_controller.rb

  def create
    p params
    @review = Review.new(review_params)
    @review.game_id = params[:game_id]
    @review.user = current_user
    if @review.save
---
INSERT INTO "reviews" ("user_id", "game_id", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["game_id", 1], ["title", "sadasdas"], ["body", "asdasdasdas"], ["created_at", 2017-04-21 05:49:49 UTC], ["updated_at", 2017-04-21 05:49:49 UTC]]