app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "game_tags".* FROM "game_tags" WHERE "game_tags"."tag_id" = $1  [["tag_id", 1]]
---
  def show
    @tag = Tag.find(params[:id])