app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "games".* FROM "games"
---
	def show
		@current_user = current_user
		@user = User.find(params[:id])
		@games = Game.all